.. _ccc_userguide:

CCC Strings
============

Introduction
------------

The function :func:`clean_es_ccc() <dataprep.clean.clean_es_ccc.clean_es_ccc>` cleans a column containing Spanish Bank Account Code (CCC) strings, and standardizes them in a given format. The function :func:`validate_es_ccc() <dataprep.clean.clean_es_ccc.validate_es_ccc>` validates either a single CCC strings, a column of CCC strings or a DataFrame of CCC strings, returning `True` if the value is valid, and `False` otherwise.

CCC strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "12341234161234567890"
* `standard`: CCC strings with proper whitespace in the proper places, like "1234 1234 16 12345 67890"
* `iban`: convert the number to an IBAN in compact format, like "ES7712341234161234567890".

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_es_ccc()` and `validate_es_ccc()`.

### An example dataset containing CCC strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "ccc": [
            "12341234161234567890",
            "134-1234-16 1234567890",
            "999 999 999",
            "004085616",
            "002 724 334",
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

                      ccc                                           address
0    12341234161234567890                                     123 Pine Ave.
1  134-1234-16 1234567890                                           main st
2             999 999 999                      1234 west main heights 57033
3               004085616                    apt 1 789 s maple rd manhattan
4             002 724 334                robie house, 789 north main street
5                   hello         1111 S Figueroa St, Los Angeles, CA 90015
6                     NaN  (staples center) 1111 S Figueroa St, Los Angeles
7                    NULL                                             hello

## 1. Default `clean_es_ccc`

By default, `clean_es_ccc` will clean ccc strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_es_ccc
clean_es_ccc(df, column = "ccc")

,ccc,address,ccc_clean
0,12341234161234567890,123 Pine Ave.,1234 1234 16 12345 67890
1,134-1234-16 1234567890,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_es_ccc(df, column = "ccc", output_format="standard")

,ccc,address,ccc_clean
0,12341234161234567890,123 Pine Ave.,1234 1234 16 12345 67890
1,134-1234-16 1234567890,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `compact`

In [4]:
clean_es_ccc(df, column = "ccc", output_format="compact")

,ccc,address,ccc_clean
0,12341234161234567890,123 Pine Ave.,12341234161234567890
1,134-1234-16 1234567890,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `iban`

In [5]:
clean_es_ccc(df, column = "ccc", output_format="iban")

,ccc,address,ccc_clean
0,12341234161234567890,123 Pine Ave.,ES7712341234161234567890
1,134-1234-16 1234567890,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned CCC strings is added with a title in the format `"{original title}_clean"`.

In [6]:
clean_es_ccc(df, column="ccc", inplace=True)

                  ccc_clean                                           address
0  1234 1234 16 12345 67890                                     123 Pine Ave.
1                       NaN                                           main st
2                       NaN                      1234 west main heights 57033
3                       NaN                    apt 1 789 s maple rd manhattan
4                       NaN                robie house, 789 north main street
5                       NaN         1111 S Figueroa St, Los Angeles, CA 90015
6                       NaN  (staples center) 1111 S Figueroa St, Los Angeles
7                       NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [7]:
clean_es_ccc(df, "ccc", errors="coerce")

,ccc,address,ccc_clean
0,12341234161234567890,123 Pine Ave.,1234 1234 16 12345 67890
1,134-1234-16 1234567890,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `ignore`

In [8]:
clean_es_ccc(df, "ccc", errors="ignore")

,ccc,address,ccc_clean
0,12341234161234567890,123 Pine Ave.,1234 1234 16 12345 67890
1,134-1234-16 1234567890,main st,134-1234-16 1234567890
2,999 999 999,1234 west main heights 57033,999 999 999
3,004085616,apt 1 789 s maple rd manhattan,004085616
4,002 724 334,"robie house, 789 north main street",002 724 334
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",hello
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 4. `validate_es_ccc()`

`validate_es_ccc()` returns `True` when the input is a valid CCC. Otherwise it returns `False`.

The input of `validate_es_ccc()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_es_ccc()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_es_ccc()` returns the validation result for the whole DataFrame.

In [9]:
from dataprep.clean import validate_es_ccc
print(validate_es_ccc("12341234161234567890"))
print(validate_es_ccc("134-1234-16 1234567890"))
print(validate_es_ccc("999 999 999"))
print(validate_es_ccc("51824753556"))
print(validate_es_ccc("004085616"))
print(validate_es_ccc("hello"))
print(validate_es_ccc(np.nan))
print(validate_es_ccc("NULL"))

True
False
False
False
False
False
False
False

### Series

In [10]:
validate_es_ccc(df["ccc"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: ccc, dtype: bool

### DataFrame + Specify Column

In [11]:
validate_es_ccc(df, column="ccc")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: ccc, dtype: bool

### Only DataFrame

In [12]:
validate_es_ccc(df)

     ccc  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False
7  False    False